import time
from config import bot
from database import get_player
from keyboards import get_main_menu

@bot.message_handler(commands=['start'])
def welcome(message):
    user_id = str(message.from_user.id)
    get_player(user_id)
    
    msg_1 = (
        "🌲 <b>Вітаємо у Greenwood!</b> 🌳\n\n"
        "Магічний ліс відкриває свои таємниці... А я — 🪷 <b>Lilly Pond</b> 🪷, твій магічний провідник у цьому затишному світі. "
        "Я допомагатиму тобі перетворювати твої реальні досягнення на справжню силу персонажа!"
    )
    bot.send_message(message.chat.id, msg_1, parse_mode="HTML")
    
    time.sleep(3)
    
    msg_2 = (
        "🔮 <b>Як влаштований наш світ:</b>\n"
        "Твій персонаж розвиває 5 основних сфер життя. Кожна з них стартує з 1 рівня і потребує <b>10 XP</b> для першого підвищення левелу.\n\n"
        "💪 <b>Здоров'я</b> — yoga, тренування, корисна їжа і тд.\n"
        "🧠 <b>Мудрість</b> — читання, навчання, вивчення мов, кодинг і тд.\n"
        "🎨 <b>Творчість</b> — малювання, гра на інструментах, в'язання і тд.\n"
        "💵 <b>Фінанси</b> — робота, планування бюджету і тд.\n"
        "🤝 <b>Зв'язки</b> — спілкування з близькими, допомога, турбота про рослин чи тварин.\n\n"
        "🎯 <b> Розділ  Мої Квести :</b>\n"
        "Це твоє магічне джерело мотивації! Тут ти можеш структурувати свої цілі: створювати <b>📜 Сувої</b> для "
        "справ із дедлайнами, налаштовувати щоденні <b>🔄 Ритуали</b> для корисних звичок на кожен день або саджати великі цілі в "
        "<b>🌱 Теплиці </b>."
    )
    bot.send_message(message.chat.id, msg_2, parse_mode="HTML", reply_markup=get_main_menu())
